---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterSlotFailures.ComponentRepeaterSlot_InvalidFamilyOnReload
source: html/846a6cba-b4fd-0401-5e59-ad9088a807e7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterSlotFailures.ComponentRepeaterSlot_InvalidFamilyOnReload Property

Reloaded family not appropriate for repeated component.

## Syntax (C#)
```csharp
public static FailureDefinitionId ComponentRepeaterSlot_InvalidFamilyOnReload { get; }
```